## Data Cleaning
### Numpy
#### Filter

In [1]:
import numpy as np

In [2]:
arr = np.array([41, 42, 43, 44])

x = [True, False, True, False]

newarr = arr[x]

print(newarr)

[41 43]

In [3]:
arr = np.array([41, 42, 43, 44])

# Create an empty list
filter_arr = []

# go through each element in arr
for element in arr:
    # if the element is higher than 42, set the value to True, otherwise False:
    if element > 42:
        filter_arr.append(True)
    else:
        filter_arr.append(False)

newarr = arr[filter_arr]

print(filter_arr)
print(newarr)

[False, False, True, True]
[43 44]

In [4]:
arr = np.array([41, 42, 43, 44])

filter_arr = arr > 42

newarr = arr[filter_arr]

print(filter_arr)
print(newarr)

[False False  True  True]
[43 44]

In [5]:
arr = np.array([1, 2, 3, 4, 5, 6, 7])

filter_arr = arr % 2 == 0

newarr = arr[filter_arr]

print(filter_arr)
print(newarr)

[False  True False  True False  True False]
[2 4 6]

### Pandas Filtragem

In [6]:
import pandas as pd

In [18]:
# Lendo tabela
url = 'https://raw.githubusercontent.com/rsucupira/Evolutionary-Optimization/master/GM.csv'
df = pd.read_csv(url)
df.head()

         Date       Open       High        Low      Close  Adj Close   Volume
0  2019-03-04  39.700001  41.500000  39.029999  39.250000  37.666031  7524500
1  2019-03-05  39.279999  39.419998  39.020000  39.279999  37.694820  4866200
2  2019-03-06  39.240002  39.290001  38.490002  38.669998  37.109436  9413300
3  2019-03-07  38.099998  38.340000  37.639999  38.040001  36.867149  8999800
4  2019-03-08  37.630001  38.040001  37.500000  37.990002  36.818687  6911000

In [19]:
# Verificando indices das colunas
df.columns

Index(['Date', 'Open', 'High', 'Low', 'Close', 'Adj Close', 'Volume'], dtype='object')

In [20]:
# Modificando indices para as colunas
df.set_axis(['Date_', 'Open_', 'High_', 'Low_', 'Close_', 'Adj Close_', 'Volume_'], axis=1)
#df.head()

,Date_,Open_,High_,Low_,Close_,Adj Close_,Volume_
0,2019-03-04,39.700001,41.500000,39.029999,39.250000,37.666031,7524500
1,2019-03-05,39.279999,39.419998,39.020000,39.279999,37.694820,4866200
2,2019-03-06,39.240002,39.290001,38.490002,38.669998,37.109436,9413300
3,2019-03-07,38.099998,38.340000,37.639999,38.040001,36.867149,8999800
4,2019-03-08,37.630001,38.040001,37.500000,37.990002,36.818687,6911000
...,...,...,...,...,...,...,...
248,2020-02-26,32.099998,32.610001,31.889999,32.000000,32.000000,14421900
249,2020-02-27,31.299999,31.920000,30.549999,30.709999,30.709999,14940400
250,2020-02-28,29.780001,30.500000,29.330000,30.500000,30.500000,20832300
251,2020-03-02,30.520000,31.450001,29.740000,31.420000,31.420000,14992100
252,2020-03-03,31.500000,32.299999,30.270000,30.730000,30.730000,12336039

In [21]:
df['Open'].head()

0    39.700001
1    39.279999
2    39.240002
3    38.099998
4    37.630001
Name: Open, dtype: float64

In [32]:
# Criando filtro com | (or)
filtro = (df['Open']>40) | (df['Low']>40)
filtro

0      False
1      False
2      False
3      False
4      False
       ...
248    False
249    False
250    False
251    False
252    False
Length: 253, dtype: bool

In [33]:
# Aplicando filtro
df[filtro]

,Date,Open,High,Low,Close,Adj Close,Volume
32,2019-04-17,40.099998,40.259998,39.880001,39.990002,38.757023,8643500
38,2019-04-26,40.049999,40.099998,39.439999,39.680000,38.456585,11830500
98,2019-07-23,40.349998,40.919998,40.150002,40.709999,39.877632,12584300
99,2019-07-24,40.590000,40.910000,40.330002,40.880001,40.044159,7318200
100,2019-07-25,40.340000,40.820000,40.119999,40.750000,39.916817,8304800
101,2019-07-26,40.720001,41.000000,40.470001,40.770000,39.936405,5705900
102,2019-07-29,40.709999,40.880001,40.560001,40.680000,39.848248,5711200
103,2019-07-30,40.259998,40.560001,39.919998,40.430000,39.603355,5436900
104,2019-07-31,40.599998,40.720001,40.110001,40.340000,39.515198,10155700
105,2019-08-01,41.259998,41.900002,39.669998,40.150002,39.329082,18102900

In [34]:
# Verificando se a mudança foi feita
df

,Date,Open,High,Low,Close,Adj Close,Volume
0,2019-03-04,39.700001,41.500000,39.029999,39.250000,37.666031,7524500
1,2019-03-05,39.279999,39.419998,39.020000,39.279999,37.694820,4866200
2,2019-03-06,39.240002,39.290001,38.490002,38.669998,37.109436,9413300
3,2019-03-07,38.099998,38.340000,37.639999,38.040001,36.867149,8999800
4,2019-03-08,37.630001,38.040001,37.500000,37.990002,36.818687,6911000
...,...,...,...,...,...,...,...
248,2020-02-26,32.099998,32.610001,31.889999,32.000000,32.000000,14421900
249,2020-02-27,31.299999,31.920000,30.549999,30.709999,30.709999,14940400
250,2020-02-28,29.780001,30.500000,29.330000,30.500000,30.500000,20832300
251,2020-03-02,30.520000,31.450001,29.740000,31.420000,31.420000,14992100
252,2020-03-03,31.500000,32.299999,30.270000,30.730000,30.730000,12336039

In [35]:
# Criando lista para datas a serem filtradas
dias = range(8,27)
lista_datas = []
for dia in dias:
    string = '2019-04-{:02d}'.format(dia)
    lista_datas.append(string)

lista_datas

['2019-04-08',
 '2019-04-09',
 '2019-04-10',
 '2019-04-11',
 '2019-04-12',
 '2019-04-13',
 '2019-04-14',
 '2019-04-15',
 '2019-04-16',
 '2019-04-17',
 '2019-04-18',
 '2019-04-19',
 '2019-04-20',
 '2019-04-21',
 '2019-04-22',
 '2019-04-23',
 '2019-04-24',
 '2019-04-25',
 '2019-04-26']

In [36]:
# Aplicando em uma máscara
mascara = df['Date'].isin(lista_datas)
mascara

0      False
1      False
2      False
3      False
4      False
       ...
248    False
249    False
250    False
251    False
252    False
Name: Date, Length: 253, dtype: bool

In [37]:
# Verificando resultado
df[mascara]

,Date,Open,High,Low,Close,Adj Close,Volume
25,2019-04-08,38.770000,39.090000,38.759998,39.060001,37.855701,5992400
26,2019-04-09,38.849998,39.080002,38.700001,38.860001,37.661865,6528900
27,2019-04-10,38.889999,39.419998,38.779999,39.250000,38.039841,5471100
28,2019-04-11,39.380001,39.590000,39.130001,39.330002,38.117371,4581500
29,2019-04-12,39.599998,40.049999,39.529999,39.709999,38.485653,4949700
30,2019-04-15,39.900002,40.009998,39.349998,39.570000,38.349972,5179400
31,2019-04-16,39.560001,39.910000,39.459999,39.660000,38.437199,5985300
32,2019-04-17,40.099998,40.259998,39.880001,39.990002,38.757023,8643500
33,2019-04-18,40.000000,40.450001,39.980000,40.299999,39.057465,10678000
34,2019-04-22,40.000000,40.099998,39.490002,39.500000,38.282131,7203800
35,2019-04-23,39.400002,39.840000,39.180000,39.830002,38.601959,9507500
36,2019-04-24,39.509998,39.889999,39.369999,39.720001,38.495350,5564700
37,2019-04-25,39.520000,39.720001,38.950001,39.110001,37.904156,8154600
38,2019-04-26,40.049999,40.099998,39.439999,39.680000,38.456585,11830500

### Data Cleaning / Limpeza de Dados

In [38]:
ss = pd.Series([7, 5, np.nan, -888, -999, None,  9])

In [39]:
ss.dropna()

0      7.0
1      5.0
3   -888.0
4   -999.0
6      9.0
dtype: float64

In [40]:
ss.fillna(1000)

0       7.0
1       5.0
2    1000.0
3    -888.0
4    -999.0
5    1000.0
6       9.0
dtype: float64

In [41]:
ss.isnull()

0    False
1    False
2     True
3    False
4    False
5     True
6    False
dtype: bool

In [42]:
ss.notnull()

0     True
1     True
2    False
3     True
4     True
5    False
6     True
dtype: bool

In [43]:
ss.replace(-999, np.nan)

0      7.0
1      5.0
2      NaN
3   -888.0
4      NaN
5      NaN
6      9.0
dtype: float64

In [44]:
ss.replace([-999, -888], np.nan)

0    7.0
1    5.0
2    NaN
3    NaN
4    NaN
5    NaN
6    9.0
dtype: float64

In [45]:
ss.replace([-999, -888], [0, np.nan])

0    7.0
1    5.0
2    NaN
3    NaN
4    0.0
5    NaN
6    9.0
dtype: float64

In [47]:
ss.replace({-999: 0, -888: np.nan})

0    7.0
1    5.0
2    NaN
3    NaN
4    0.0
5    NaN
6    9.0
dtype: float64

In [48]:
ss2 = pd.DataFrame({'col1':[1,2,3,np.nan],

                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
ss2.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [49]:
ss2.dropna()

   col1   col2 col3
1   2.0  555.0  def
2   3.0  666.0  ghi

In [50]:
ss2.dropna(axis=1)

  col3
0  abc
1  def
2  ghi
3  xyz

In [51]:
ss2.fillna('Isso não é um número')

                   col1                  col2 col3
0                     1  Isso não é um número  abc
1                     2                   555  def
2                     3                   666  ghi
3  Isso não é um número                   444  xyz

In [52]:
ss2.isnull().sum()

col1    1
col2    1
col3    0
dtype: int64